Assignement/Lab02-incompFlows/combustorPimple/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    fuel_inlet
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    back
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    sides
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
